export const ORDER_PARSER_HINT = `Правила заповнення даних:

Введений рядок автоматично розбивається на значення у такому порядку:
1) Перше значення — ім’я
2) Друге значення — по батькові
3) Третє значення — прізвище
4) Четверте значення — номер телефону

Значення мають бути розділені пробілом.

Приклади:
* Іван Іванович Петренко 0991234567
→ Ім’я: Іван
→ По батькові: Іванович
→ Прізвище: Петренко
→ Телефон: 0991234567

* Олена Сергіївна Коваль 0509876543
→ Ім’я: Олена
→ По батькові: Сергіївна
→ Прізвище: Коваль
→ Телефон: 0509876543

* Петро Олексійович Бондар 0671112233
→ Ім’я: Петро
→ По батькові: Олексійович
→ Прізвище: Бондар
→ Телефон: 0671112233

Зверніть увагу! Порядок значень є важливим. Якщо якесь значення відсутнє — відповідне поле залишиться порожнім або може бути заповнене некоректно.`;

export const DELIVERY_PARSER_HINT = `Правила заповнення даних:

Введений рядок автоматично розбивається на значення у такому порядку:
1) Перше значення — ім’я
2) Друге значення — по батькові
3) Третє значення — прізвище
4) Четверте значення — номер телефону
5) П'яте значення — місто, село чи інший населений пункт

Значення мають бути розділені пробілом.

Приклади:
* Іван Іванович Петренко 0991234567 м. Київ
→ Ім’я: Іван
→ По батькові: Іванович
→ Прізвище: Петренко
→ Телефон: 0991234567
→ Місто: Київ

* Олена Сергіївна Коваль 0509876543 Черкаси
→ Ім’я: Олена
→ По батькові: Сергіївна
→ Прізвище: Коваль
→ Телефон: 0509876543
→ Місто: Черкаси

* Петро Олексійович Бондар 0671112233 с. Масівці
→ Ім’я: Петро
→ По батькові: Олексійович
→ Прізвище: Бондар
→ Телефон: 0671112233
→ Місто: Масівці

Зверніть увагу! Порядок значень є важливим. Якщо якесь значення відсутнє — відповідне поле залишиться порожнім або може бути заповнене некоректно.`;